feat: convertir diagramas ASCII a Mermaid en Balanceador de carga y Aplication Gateway
